---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyFloat
source: html/6aac7b14-1c01-2f6f-3478-68a944a3f117.htm
---
# AssetPropertyFloat Methods

Adds a new connected asset attached to this asset property, if it allows it.